In [2]:
import numpy as np
import pandas as pd

In [11]:
titanic_train=pd.read_csv("0000000000002429_training_titanic_x_y_train.csv",delimiter=",")
titanic_test=pd.read_csv("0000000000002429_test_titanic_x_test.csv",delimiter=",")
titanic=pd.concat([titanic_train,titanic_test]) ###
titanic

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1.0
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0.0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0.0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0.0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...
218,3,"Lindqvist, Mr. Eino William",male,20.0,1,0,STON/O 2. 3101285,7.925,NaN,S,NaN
219,1,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.550,B38,S,NaN
220,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.900,C65,C,NaN
221,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.450,NaN,S,NaN
222,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.000,F2,S,NaN

In [12]:
titanic.shape

(891, 11)

In [16]:
Y=titanic["Survived"]
X=titanic.drop("Survived",axis=1)
X.shape, Y.shape

((891, 10), (891,))

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
x_train,x_test,y_train,y_test=train_test_split(X,Y,random_state=12320)

In [25]:
x_y_train=x_train.copy()

In [26]:
x_y_train["Survived"]=y_train

In [27]:
x_y_train.isnull().sum()

Pclass        0
Name          0
Sex           0
Age          41
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       170
Embarked      0
Survived     58
dtype: int64

In [28]:
del x_y_train["Name"]
del x_y_train["Ticket"]
del x_y_train["Cabin"]
del x_y_train["Fare"]
######################
del x_test["Name"]
del x_test["Ticket"]
del x_test["Cabin"]
del x_test["Fare"]

In [ ]:
x_y_train=x_y_train.fillna()